IDEA StatiCa Open Model
ExposureClassesDataEc2 Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Exposure Classes Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.ExposureClassesDataEc2
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ExposureClassesDataEc2
Public Class ExposureClassesDataEc2
public ref class ExposureClassesDataEc2
The ExposureClassesDataEc2 type exposes the following members.
Constructors
Name | Description
ExposureClassesDataEc2
 Constructor
Top
Properties
Name | Description
Carbonation
 Combo box Carbonation
CarbonationCheck
 Check box Carbonation
FreezeAttack
 Combo box Freeze/Thaw Attack
FreezeAttackCheck
 Check box Freeze/Thaw Attack
ChemicalAttack
 Combo box Chemical Attack
ChemicalAttackCheck
 Check box Chemical Attack
Chlorides
 Combo box Chlorides
ChloridesFromSea
 Combo box Chlorides from sea
ChloridesFromSeaCheck
 Check box Chlorides from sea
ChloridesCheck
 Check box Chlorides
NoCorrosionCheck
 Check box No corrosion
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace